app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 2]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 1]]
---
 <% if photo.favorited_by?(current_user) %>
  <%= link_to photo.favorites.count, photo_favorites_path(photo), method: :delete, remote: true, class: "fas fa-heart" %>
 <% else %>
  <%= link_to photo.favorites.count, photo_favorites_path(photo), method: :post, remote: true, class: "fas fa-heart heart_blue" %>