app/views/photos/index.html.erb

<%#photo一覧%>
<div class="container py-4" id="photos">
<h3 class="text-center my-3">Clothes/Photos</h3>
<div class="row">
<% @photos.each do |photo| %>
 <% if photo.category %>
<div class="col-md-3.5 mt-2 mx-4">
<div class=" mx-3">
<%= attachment_image_tag(photo.user, :profile_image, :fill, 300, 300, fallback: "noimage.jpeg",size: '50x50', class: "rounded-circle" ) %>
<%= link_to user_path(photo.user.id) do %>
<%= photo.user.name %>
<% end %>
</div>
<div class="card-deck">
<div class="card">
<%= link_to photo_path(photo) do %>
<%= attachment_image_tag photo, :image, :fill, 300, 300, format: 'jpeg', fallback: '20200501_noimage.jpg', size: '300x300', class: "rounded"%>
<% end %>
<div class="card-body">
<h6 class="card-title"><%= photo.name %></h6>
<p class="card-text"><%= render_with_hashtags(photo.caption) %></p>
<p>［Category] :
---
SELECT "photos".* FROM "photos"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]