app/views/photos/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 1]]
SELECT COUNT(*) FROM "photo_comments" WHERE "photo_comments"."photo_id" = ?  [["photo_id", 4]]
---
<div class="card-body mx-auto">
<p><%= render "favorites/favorite-btn", photo: @photo %>件のいいね！<i class="far fa-comment"></i><%= @photo.photo_comments.count %></p>