app/controllers/favorites_controller.rb

  def create
    @photo = Photo.find(params[:photo_id])
    favorite = @photo.favorites.new(user_id: current_user.id)
    favorite.save
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "photo_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["photo_id", 2], ["created_at", "2021-05-13 08:36:08.476629"], ["updated_at", "2021-05-13 08:36:08.476629"]]

  def destroy
    @photo = Photo.find(params[:photo_id])
    favorite = @photo.favorites.find_by(user_id: current_user.id)
    favorite.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."photo_id" = ? AND "favorites"."user_id" = ? LIMIT ?  [["photo_id", 2], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]