app/controllers/homes_controller.rb

INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES (?, ?, ?, ?)
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "guest@example.com"], ["LIMIT", 1]]
---
  def guest_sign_in
    user = User.find_or_create_by!(email: 'guest@example.com') do |user|