app/controllers/photo_comments_controller.rb

  def create
    @photo = Photo.find(params[:photo_id])
		@photo_comment = PhotoComment.new(photo_comment_params)
		@photo_comment.photo_id = @photo.id
		@photo_comment.user_id = current_user.id
		if @photo_comment.save
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "photo_comments" ("user_id", "photo_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 3], ["photo_id", 4], ["comment", "かっこいい！"], ["created_at", "2021-05-16 04:47:54.767612"], ["updated_at", "2021-05-16 04:47:54.767612"]]

  def destroy
    @photo = Photo.find(params[:photo_id])
  	photo_comment = @photo.photo_comments.find(params[:id])
		photo_comment.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "photo_comments".* FROM "photo_comments" WHERE "photo_comments"."photo_id" = ? AND "photo_comments"."id" = ? LIMIT ?  [["photo_id", 4], ["id", 1], ["LIMIT", 1]]
DELETE FROM "photo_comments" WHERE "photo_comments"."id" = ?  [["id", 1]]