app/controllers/photos_controller.rb

  def hashtag
    @user = current_user
    @tag = Hashtag.find_by(hashname: params[:name])
---
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."hashname" = ? LIMIT ?  [["hashname", "＃かっこいい"], ["LIMIT", 1]]

  def ranking
    @photos = Photo.includes(:favorited_users).sort {|a,b| b.favorited_users.size <=> a.favorited_users.size}
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."photo_id" = ?  [["photo_id", 6]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."photo_id" IN (?, ?, ?, ?, ?, ?)  [["photo_id", 4], ["photo_id", 6], ["photo_id", 7], ["photo_id", 8], ["photo_id", 9], ["photo_id", 10]]
SELECT "photos".* FROM "photos"
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 1], ["id", 3]]

  def category
    @photo = Photo.find_by(category_id: params[:id])
---
SELECT  "photos".* FROM "photos" WHERE "photos"."category_id" IS NULL LIMIT ?  [["LIMIT", 1]]

  def create
    @photo = Photo.new(photo_params)
    @photo.user_id = current_user.id
    @photo.save
---
INSERT INTO "photos" ("created_at", "updated_at", "name", "user_id", "image_id", "caption", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    #@user = current_user
    @photo = Photo.find(params[:id])
    @photo.destroy
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 14]]