app/controllers/photos_controller.rb

DELETE FROM "photos" WHERE "photos"."id" = ?  [["id", 1]]
---
  def destroy
    #@user = current_user
    @photo = Photo.find(params[:id])
    @photo.destroy