app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "photos".* FROM "photos" WHERE "photos"."user_id" = ? ORDER BY "photos"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 25], ["OFFSET", 0]]
---
  def show
    @user = User.find(params[:id])
    #pageメソッドを利用して、すべての投稿画像が表示されないように設定
    @photos = @user.photos.page(params[:page]).reverse_order

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "f05072370c02691b37f370b16ef7cccdd729b0b6d8824cd2af6b2989b0f9"], ["introduction", "こんにちは！"], ["updated_at", "2021-05-15 08:58:32.652809"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)