app/models/photo.rb

  def favorited_by?(user)
    favorites.where(user_id: user.id).exists?
  end

  #DBへのコミット直前に実施する
   after_create do
    photo = Photo.find_by(id: self.id)
    hashtags  = self.caption.scan(/[#＃][\w\p{Han}ぁ-ヶｦ-ﾟー]+/)
    photo.hashtags = []
    hashtags.uniq.map do |hashtag|
      #ハッシュタグは先頭の'#'を外した上で保存
      tag = Hashtag.find_or_create_by(hashname: hashtag.downcase.delete('#'))
      photo.hashtags << tag
    end
  end

  before_update do
    photo = Photo.find_by(id: self.id)
    photo.hashtags.clear
    hashtags = self.caption.scan(/[#＃][\w\p{Han}ぁ-ヶｦ-ﾟー]+/)
    hashtags.uniq.map do |hashtag|
      tag = Hashtag.find_or_create_by(hashname: hashtag.downcase.delete('#'))
---
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "hashtags".* FROM "hashtags" INNER JOIN "photo_hashtag_relations" ON "hashtags"."id" = "photo_hashtag_relations"."hashtag_id" WHERE "photo_hashtag_relations"."photo_id" = ?  [["photo_id", 2]]
INSERT INTO "hashtags" ("hashname", "created_at", "updated_at") VALUES (?, ?, ?)  [["hashname", "test"], ["created_at", "2021-05-13 08:24:57.649203"], ["updated_at", "2021-05-13 08:24:57.649203"]]
SELECT  "hashtags".* FROM "hashtags" WHERE "hashtags"."hashname" = ? LIMIT ?  [["hashname", "test"], ["LIMIT", 1]]
INSERT INTO "hashtags" ("hashname", "created_at", "updated_at") VALUES (?, ?, ?)  [["hashname", "test"], ["created_at", "2021-05-14 06:36:21.512642"], ["updated_at", "2021-05-14 06:36:21.512642"]]
SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]