app/views/photo_comments/_index.html.erb

  <table class="mx-2">
  <% photo.photo_comments.each do |photo_comment| %>
---
SELECT "photo_comments".* FROM "photo_comments" WHERE "photo_comments"."photo_id" = ?  [["photo_id", 4]]